/**************************************************************************
**文件名：main.c
**功能：利用栈的先进后出规则，结合递归，实现字符串逆序打印 
**作者：朱飞东 
**QQ：1003768663
**日期：2014.9.23
***************************************************************************/ 
#include <stdio.h>

void reverse(char* s)
{
    if( (s != NULL) && (*s != '\0') )
    {
        reverse(s + 1);          //运行递归,活动记录压入栈 
        
        printf("%c", *s);    //在退栈的时候被调用 
    }
    
}

int main()
{
    reverse("12345");
    
    printf("\n over \n");
    
    return 0;
}
