/*****************************************************************************
**文件名：SeqStack.c 
**功能：利用顺序链表,实现栈 的相关函数 
**作者：朱飞东 
**QQ：1003768663
**日期：2014.9.24
*****************************************************************************/
 
#include "SeqStack.h"
#include "SeqList.h"


/****************************************************************************
**函数名：SeqStack_Create
**功能：创建栈 
**输入参数：int capacity ：栈容量 
**输出参数： SeqStack ：栈的首地址 
****************************************************************************/
SeqStack* SeqStack_Create(int capacity)      //创建栈 
{
	return SeqList_Create(capacity);
}
/****************************************************************************
**函数名：SeqStack_Destroy
**功能：销毁栈 
**输入参数：SeqStack* stack ：栈名称 
**输出参数： 无
****************************************************************************/
void SeqStack_Destroy(SeqStack* stack)       //销毁栈 
{
	SeqList_Destroy(stack);
}

/****************************************************************************
**函数名：SeqStack_Clear
**功能：请空栈 
**输入参数：SeqStack* stack ：栈名称 
**输出参数： 无
****************************************************************************/
void SeqStack_Clear(SeqStack* stack)     //清空栈 
{
	SeqList_Clear(stack);
}
/****************************************************************************
**函数名：SeqStack_Length 
**功能：返回栈长度 
**输入参数：SeqStack* stack ：栈名称 
**输出参数： 栈长度 
****************************************************************************/
int SeqStack_Length(SeqStack* stack)      //读取栈长度 
{
	return SeqList_Length(stack);
} 
/****************************************************************************
**函数名：SeqStack_Capacity
**功能：返回栈容量 
**输入参数：SeqStack* stack ：栈名称 
**输出参数： 栈容量 
****************************************************************************/
int SeqStack_Capacity(SeqStack* stack)      //捕获栈容量 
{
	return SeqList_Capacity(stack); 
}
/****************************************************************************
**函数名：SeqStack_Push 
**功能：压入栈 
**输入参数：SeqStack* stack ：栈名称  void* node : 压入数据的地址 
**输出参数：  
****************************************************************************/
int SeqStack_Push(SeqStack* stack, void* node)     //压入栈 
{
	return SeqList_Insert(stack, node, SeqStack_Length(stack));
}
/****************************************************************************
**函数名：SeqStack_Pop
**功能：弹出栈 
**输入参数：SeqStack* stack ：栈名称 
**输出参数： 弹出的数据 
****************************************************************************/
void* SeqStack_Pop(SeqStack* stack)           //弹出栈 
{
	return SeqList_Delete(stack, SeqStack_Length(stack) - 1);
}
/****************************************************************************
**函数名：SeqStack_Top
**功能：读取栈顶 
**输入参数：SeqStack* stack ：栈名称 
**输出参数： 弹出的数据 
****************************************************************************/
void* SeqStack_Top(SeqStack* stack)
{
    return SeqList_Get(stack, SeqList_Length(stack) - 1);
}

