/***************************************************************************
**文件名：ShellSort.c
**功能：希尔排序相关函数实现 
**作者:朱飞东 
**QQ:  1003768663
**日期：2014.10.7
****************************************************************************/ 


/***************************************************************************
**函数名：ShellSort
**原理：对数组进行不同间隔的分组插入排序，到最后间隔为1，即结束 
		当间隔为1时，即使普通插入排序，最高效率O(N^1.3),平均O(nlogn) 
****************************************************************************/ 
void ShellSort(int *s, int len)
{
	int i=0,j=0,k=0;
	int temp = 0;
	int gap = len;	//间隔 
	
	do
	{
		gap = gap/3 + 1;	//3可以自定义为4.5...等等. 但是经验取3效率较高 
		//gap -= 1;			//gap变化没有强制要求，但是最后一次必须变成 1 
		 
		for(i=gap; i<len; i+=gap)	//按gap间隔分组 
		{
			temp = s[i];	//要插入的数据
			k = i;
			
			for(j=i-gap; (j>=0)&&(s[j]>temp); j-=gap)   //移动 
			{
				s[j+gap] = s[j];
				k = j;	
			} 
			
			s[k] = temp;   //把数据插入 
		}
	}while(gap>1);
	
}


