/***************************************************************************
**文件名：SelectSort.c
**功能：选择排序的相关函数代码 
**作者：朱飞东 
**QQ：1003768663
**日期：2014.10.7
***************************************************************************/


static void Swap(int *a,int *b)			// a,b 交换 
{
	*a = *a ^ *b;
	*b = *a ^ *b;
	*a = *a ^ *b;
}
void SelectSort(int *s,int len)       //选择排序 
{
	int i=0,j=0;

	for(i = 0; i < len-1; i++)
	{		
		for(j = i+1; j<len; j++)		//选出未排序的最小值 
		{
			if(s[i] > s[j])
			{
				Swap(&s[i], &s[j]);	
			}
		}
	}
}



