/***************************************************************************
**文件名：InsertSort.c 
**功能：插入排序相关函数实现 
**作者：朱飞东 
**QQ：1003768663 
**日期：2014.10.7
***************************************************************************/

#include "BubbleSort.h"

void Swap(int *a,int *b)
{ //交换两个数 
	(*a) ^= (*b);   //最好的方法 
	(*b) ^= (*a);
	(*a) ^= (*b);
} 
void BubbleSort(int *s, int len)
{
	int i = 0;
	int j = 0;
	int flag = 0;
	/*
	for(i=0; i<size-1;i++)   //冒泡排序、每次都需要遍历全部、效率低下 
	{
		for(j=1; j<size;j++)
			if(s[j] > s[j+1])
				Swap(&s[j],&s[j+1]);
	}
	*/
	flag = len;
	while(flag>0)   //改进冒泡排序、用去数组一部分已经排好序的，但是不知道具体有多少是排好序的 
	{
		i = flag;
		flag = 0; 
		for(j=0; j<i-1;j++)  //第一次先遍历全部 
		{
			if(s[j] > s[j+1])
			{
				Swap(&s[j],&s[j+1]);
				flag = j+1;   //记录下最后一个交换，剩下的就是已经排好序的了 
			}
		}
	}
}



