/***************************************************************************
**文件名：InsertSort.c 
**功能：插入排序相关函数实现 
**作者：朱飞东 
**QQ：1003768663 
**日期：2014.10.7
***************************************************************************/

#include "InsertSort.h"


void InsertSort(int *s, int len)
{
	int i = 0,j = 0;
	int k = 0;
	int temp = 0;
	
	for(i = 1; i < len; i++)
	{
		temp = s[i];	//保存需要插入的元素 
		k = i;
		
		for(j = i-1; (j>=0)&&(s[j]>temp); j--)		//对已经排序的进行移动 
		{
			s[j+1] = s[j];
			k = j;		//记录将要插入的位置 
		}	
		
		s[k] = temp;	//把数据插入 
	}
}



